
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Sadan007/aws-ecs-terraform/actions/runs/10417506345)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a0ba3b0f404ad656]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-049daabe7308b8c79]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0022df2d039942457]
aws_security_group.ecs: Refreshing state... [id=sg-0230e25f5e91bbf6c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-044792a6a3d598fb9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07b6e66be004d39ae]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-077e8afac39ee7f81]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0861cd90aa56d42b6]
aws_security_group.alb: Refreshing state... [id=sg-0d1fc9776dd76127c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0bd7da502a917f23c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-099d4144a7b649523]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04f8c8e0b309b9665]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0287c59b5885a99c2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-012128c7e9e3ed103]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3755956967]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f1712a1be07a6e9d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0453802d7798cdb1b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-004191531bb2bb6ae]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e5900bc2cb1bed80]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00830b3a788daeb9a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07b6e66be004d39ae1080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04c7618844f27ab19]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0442f98185814e850]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-06ac392df96d8681d]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0bd7da502a917f23c1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-099d4144a7b6495231080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0d1fc9776dd76127c",
        ]
      + subnets                                                      = [
          + "subnet-0287c59b5885a99c2",
          + "subnet-04f8c8e0b309b9665",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a0ba3b0f404ad656"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:targetgroup/go-simple-server-target-group/7894f79483bdc394]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Creation complete after 3m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:loadbalancer/app/go-simple-server-alb/752a45a4afc3cad1]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener/app/go-simple-server-alb/752a45a4afc3cad1/8542745b4888efd0]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener-rule/app/go-simple-server-alb/752a45a4afc3cad1/8542745b4888efd0/624c533f59d8e9fe]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"aca3c976ff4b826e8086125d1a38c0286d278e3f","Vars":{},"WorkflowName":"Terraform"} -->